{"format": "graph-model", "generatedBy": "2.5.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"Accuracy_calc/prediction": {"name": "Accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "Dropout_layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer_1/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer_1/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Dropout_layer/GreaterEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer_2/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer_2/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output/W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output/B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer_1/MatMul", "op": "MatMul", "input": ["X", "Layer_1/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Layer_1/add", "op": "AddV2", "input": ["Layer_1/MatMul", "Layer_1/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer_1/Relu", "op": "Relu", "input": ["Layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_layer/Mul", "op": "Mul", "input": ["Dropout_layer/Const", "Layer_1/Relu"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_layer/Shape", "op": "Shape", "input": ["Layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "Dropout_layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["Dropout_layer/Shape"], "attr": {"seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "Dropout_layer/GreaterEqual", "op": "GreaterEqual", "input": ["Dropout_layer/random_uniform/RandomUniform", "Dropout_layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_layer/Cast", "op": "Cast", "input": ["Dropout_layer/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "Dropout_layer/Mul_1", "op": "Mul", "input": ["Dropout_layer/Mul", "Dropout_layer/Cast"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Layer_2/MatMul", "op": "MatMul", "input": ["Dropout_layer/Mul_1", "Layer_2/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Layer_2/add", "op": "AddV2", "input": ["Layer_2/MatMul", "Layer_2/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer_2/Relu", "op": "Relu", "input": ["Layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/MatMul", "op": "MatMul", "input": ["Layer_2/Relu", "Output/W"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Output/add", "op": "AddV2", "input": ["Output/MatMul", "Output/B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/Softmax", "op": "Softmax", "input": ["Output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Accuracy_calc/prediction", "op": "ArgMax", "input": ["Output/Softmax", "Accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Dropout_layer/Const", "shape": [], "dtype": "float32"}, {"name": "Layer_1/W", "shape": [784, 512], "dtype": "float32"}, {"name": "Layer_1/B", "shape": [512], "dtype": "float32"}, {"name": "Dropout_layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "Layer_2/W", "shape": [512, 64], "dtype": "float32"}, {"name": "Layer_2/B", "shape": [64], "dtype": "float32"}, {"name": "Output/W", "shape": [64, 10], "dtype": "float32"}, {"name": "Output/B", "shape": [10], "dtype": "float32"}, {"name": "Accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}